/*----------------------------------------------------------------<Header>-
Name: Tetromino.h
Title: Хедер для тетроміно.
Group : ТВ-43
Student: Галюк Д. В.
Written: 2025-05-16
Revised: 2025-05-18
Description: Заголовочний файл з визначенням координат тетроміно та який
описує типи фігур і всі їх можливі обертання.
------------------------------------------------------------------</Header>-*/

#ifndef TETROMINO_H
#define TETROMINO_H

#include <vector> //Для vector
using namespace std;

/*-----------------------------------------------------------------------------
Description: Клас для збереження координат клітинки.
-----------------------------------------------------------------------------*/
class Coord {
public:
    int x, y;
    Coord(int x = 0, int y = 0) : x(x), y(y) {}
    bool operator==(const Coord& other) const {
        return x == other.x && y == other.y;
    }
};

/*-----------------------------------------------------------------------------
Description: Клас для опису типу тетроміно, генерації всіх обертань фігури,
та отримання символу-фігури(L, I, T, S).
-----------------------------------------------------------------------------*/
class Tetromino {
public:
	enum Type { L, I, T, S }; //Перелік доступних типів тетроміно
	Tetromino(Type type); //Конструктор, який створює фігуру заданого типу тетраміно
	Type getType() const; //Отримати тип фігури
	const vector<vector<Coord>>& getRotations() const; //Отримати всі можливі варіанти фігури (її положення при обертанні)
	char getFigure() const; //Отримати символ (L, I...), через який потім отримаємо зображення фігури на полі
private:
	Type type; //Тип фігури
	vector<vector<Coord>> rotations; //Всі можливі варіанти розміщення фігури, де кожне розміщення є списоком координат клітин
	void generateRotations(const vector<Coord>& base);	//Генерація варіантів обертів фігури з базового положення
	bool isDuplicate(const vector<vector<Coord>>& list, const vector<Coord>& shape); //Перевірка унікальності на положення фігури
};

#endif